export interface ArabicLetter {
  char: string;
  name: string;
  ghahr: 'جهر' | 'همس';
  strength: 'شدة' | 'رخاوة' | 'بينية';
}

export type LetterCategory = 
  | 'الشدة والجهر'
  | 'الشدة والهمس'
  | 'الرخاوة والهمس'
  | 'الرخاوة والجهر'
  | 'البينية والجهر'
  | 'البينية والهمس'
  | 'الجهر فقط'
  | 'الهمس فقط'
  | 'الشدة فقط'
  | 'الرخاوة فقط'
  | 'البينية فقط'
  | 'الجهر والرخاوة'
  | 'الجهر والشدة'
  | 'الجهر والبينية'
  | 'الهمس والرخاوة'
  | 'الهمس والشدة'
  | 'الهمس والبينية'
  | 'غير مصنف';

export type FilterCategory = LetterCategory | 'الكل';